In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

In [3]:
#read the GDP dataset into your notebook as a DataFrame called `gdp_df`. Take a look at the first 6 rows
gdp_df = pd.read_csv('/Users/bivey/Documents/GitHub/gdp-and-internet-usage-BrantIvey/gdp_percapita.csv')
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

In [4]:
#Take a look at the first six rows.
internet_df = pd.read_csv('/Users/bivey/Documents/GitHub/gdp-and-internet-usage-BrantIvey/internet_use.csv',nrows=4494)
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [5]:
#Look at the shape of each dataframe - how many rows(6731), how many columns (4)
gdp_df.shape

(6731, 4)

In [6]:
#Look at the shape of each dataframe - how many rows (4494), how many columns (4)
internet_df.shape

(4494, 4)

In [7]:
#Take a look at the data types for the columns in each table
gdp_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [8]:
#Take a look at the data types for the columns in each table
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [9]:
#Take a look at the last 10 rows of each dataset in turn.
gdp_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
6721,Zimbabwe,1997,3036.422224,NaN
6722,Zimbabwe,1996,2985.856605,NaN
6723,Zimbabwe,1995,2736.486436,NaN
6724,Zimbabwe,1994,2768.309953,NaN
6725,Zimbabwe,1993,2572.870395,NaN
6726,Zimbabwe,1992,2591.007534,NaN
6727,Zimbabwe,1991,2906.272849,NaN
6728,Zimbabwe,1990,2819.549467,NaN
6729,footnoteSeqID,Footnote,NaN,NaN
6730,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [10]:
#Take a look at the last 10 rows of each dataset in turn.
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4484        Zimbabwe  2003  6.394786              NaN
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN

In [11]:
#* Drop the 'value footnotes' data from both datasets. Check that this worked as expected.
gdp_df.drop(['Value Footnotes'], axis=1, inplace=True)

In [12]:
#* Drop the 'value footnotes' data from both datasets. Check that this worked as expected.
internet_df.drop(['Value Footnotes'], axis=1,inplace=True)

In [13]:
#Change the columns for the GDP Per Capita data frame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.
gdp_df.rename(columns={'Country or Area':'Country','Value':'GDP_Per_Capita'},inplace=True)

In [14]:
#Change the columns for the GDP Per Capita data frame to ‘Country’, ‘Year’, and "Interenet_Users_Pct".
internet_df.rename(columns={'Country or Area':'Country','Value':'Internet_Users_Pct'},inplace=True)

In [24]:
gdp_and_internet_use = gdp_df.merge(internet_df, left_on='Year', right_on='Year',how = 'outer')

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat

In [21]:
gdp_and_internet_use.head(5)

       Country Year_x  GDP_Per_Capita  Year_y  Internet_Users_Pct
0  Afghanistan   2018     1734.723214  2014.0            6.390000
1  Afghanistan   2018     1734.723214  2013.0            5.900000
2  Afghanistan   2018     1734.723214  2012.0            5.454545
3  Afghanistan   2018     1734.723214  2011.0            5.000000
4  Afghanistan   2018     1734.723214  2010.0            4.000000